app/Http/Controllers/ArticleController.php

select "tags".*, "article_tag"."article_id" as "pivot_article_id", "article_tag"."tag_id" as "pivot_tag_id", "article_tag"."created_at" as "pivot_created_at", "article_tag"."updated_at" as "pivot_updated_at" from "tags" inner join "article_tag" on "tags"."id" = "article_tag"."tag_id" where "article_tag"."article_id" in (1, 3, 4, 5, 6, 7, 8)
select "users".*, "likes"."article_id" as "pivot_article_id", "likes"."user_id" as "pivot_user_id", "likes"."created_at" as "pivot_created_at", "likes"."updated_at" as "pivot_updated_at" from "users" inner join "likes" on "users"."id" = "likes"."user_id" where "likes"."article_id" in (1, 3, 4, 5, 6, 7, 8)
select * from "articles"
---
    public function index()
    {
        $articles = Article::all()->sortByDesc('created_at')
            ->load(['user', 'likes', 'tags']);